In [43]:
import numpy as np
import pandas as pd
from datetime import datetime, timedelta

In [2]:
df = pd.read_csv(r'C:\Users\Ahmed\Downloads\dastasets\ufo.csv')

In [21]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Month,IN_December
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,June,0
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,June,0
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,February,0
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,June,0
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,April,0

# 1) part1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [8]:
df ['Time'] = pd.to_datetime(df['Time'],format = "%m/%d/%Y %H:%M", errors='raise')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 712.7+ KB

In [12]:
df['IN_December'] = df["Time"].dt.month_name()

In [17]:
def check_month(x):
    if x == 'December':
        return 1
    else:
        return 0
    
df['IN_December'] = df['IN_December'].apply(check_month)

In [18]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Month,IN_December
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,June,0
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,June,0
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,February,0
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,June,0
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,April,0

In [20]:
df['IN_December'].value_counts().to_frame()
#1034 december

   IN_December
0        17207
1         1034

# 2) part 2

In [98]:
df['Years'] = df['Time'].dt.year

* World War 1 start date that is 'July 28, 1914'

In [99]:
df['Time_Diff_From_WW1'] = (df["Time"] -  datetime(1914 , 7, 28) ) / np.timedelta64(1,'Y')

In [100]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Month,IN_December,Years,Time_Diff_From_WW1
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,June,0,1930,15.846778
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,June,0,1930,15.925949
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,February,0,1931,16.554983
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,June,0,1931,16.845087
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,April,0,1933,18.726714